INSERT INTO `quiz_questions` VALUES 
(1,'Класс отличается от объекта тем, что', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(2,'Какое понятие не относится к основным понятиям ООП?', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(3,'Что такое статический член класса?', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(4,'Наследование это:', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(5,'Как можно объявить переменную "a" в Java Script', 1, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(6,'Какие типы данных существуют в Java Script', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(7,'Какие области видимости существуют в Java Script', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(8,'Какой вариант ответа установит высоту div элемента равной 150px', 1, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(9,'Что такое EcmaScript?', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(10,'Какой тег используется для добавления JS на HTML страницу?', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(11,'Как выбрать картинку на странице по ее id? <img id="mainpic" src="cat.png">', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(12,'Что является корректным CSS синтаксисом?', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(13,'Элемент <title> должен быть в теге', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(14,'Выберите JS-код из списка', 1, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(15,'Что такое HTML?', 1, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(16,'Кто создает веб-стандарты?', 1, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(17,'Что выведется в консоли: var arr = [5, undefined];arr[4] = [4]; console.log(arr.length);', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(18,'Какие символы используются для комментариев в js', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(19,'Какие циклы встречаются в js', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(20,'Каков результат выражения: 0 + "2" + 0', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(21,'Какие функции открывают модальные окна', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(22,'Какой будет результат выполнения следующего кода: try { setTimeout(function() { console.log(bar); }, 10)} catch (err) {console.log("Error is caught");}', 4, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(23,'var arr = ["foo", "bar", "baz"]; console.log( arr.shift()[arr.length] );', 4, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(24,'Какие значение position есть в css', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(25,'Какие существуют методы для получения элементов из DOM дерева', 4, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(26,'Какие CSS селекторы валидны', 4, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(27,'Какое расширение JSON файла', 1, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(28,'Какие единицы измерения есть в CSS', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(29,'Отметьте значения, которые в логическом выражении приводятся к false', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(30,'Что такое <!DOCTYPE>', 1, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(31,'Какой будет результат [1, 2, 3, 4, 5].filter((x, i) => i > 3)', 6, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(32,'Где может указываеться директива "use strict"', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(33,'Что делает оператор "++"', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(34,'Что выведется в консоли? var b = 3 > 4; console.log( b )', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(35,'Каков результат вычисления true + false', 2, '2017-06-17 05:47:27','2017-06-17 11:33:34'),
(36,'Какой будет результат выполнения следующего кода "i`m a lasagna hog".split("").reverse().join("")', 3, '2017-06-17 05:47:27','2017-06-17 11:33:34');






